app/controllers/articles_controller.rb

  def edit #get action for the update form to user
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update #what sends the 'patch' the to db
  @article = Article.find(params[:id])
  @article.update(title: params[:article][:title], description: params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-08-06 13:15:08.341199"], ["id", 1]]